<html><head><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">.lst-kix_22iaaw6gusfk-0>li:before{content:"\0025cf  "}.lst-kix_22iaaw6gusfk-1>li:before{content:"\0025cb  "}.lst-kix_22iaaw6gusfk-4>li:before{content:"\0025cb  "}.lst-kix_22iaaw6gusfk-2>li:before{content:"\0025a0  "}.lst-kix_22iaaw6gusfk-3>li:before{content:"\0025cf  "}.lst-kix_22iaaw6gusfk-8>li:before{content:"\0025a0  "}ul.lst-kix_22iaaw6gusfk-8{list-style-type:none}ul.lst-kix_22iaaw6gusfk-7{list-style-type:none}.lst-kix_22iaaw6gusfk-5>li:before{content:"\0025a0  "}ul.lst-kix_22iaaw6gusfk-4{list-style-type:none}ul.lst-kix_22iaaw6gusfk-3{list-style-type:none}ul.lst-kix_22iaaw6gusfk-6{list-style-type:none}ul.lst-kix_22iaaw6gusfk-5{list-style-type:none}ul.lst-kix_22iaaw6gusfk-0{list-style-type:none}.lst-kix_22iaaw6gusfk-6>li:before{content:"\0025cf  "}ul.lst-kix_22iaaw6gusfk-2{list-style-type:none}.lst-kix_22iaaw6gusfk-7>li:before{content:"\0025cb  "}ul.lst-kix_22iaaw6gusfk-1{list-style-type:none}ol{margin:0;padding:0}table td,table th{padding:0}.c2{margin-left:36pt;padding-top:0pt;padding-left:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c3{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left;height:11pt}.c12{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:10pt;font-family:"Arial";font-style:normal}.c4{padding-top:0pt;padding-bottom:0pt;line-height:1.0;orphans:2;widows:2;text-align:left;height:11pt}.c7{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c10{padding-top:0pt;padding-bottom:0pt;line-height:1.0;orphans:2;widows:2;text-align:left}.c14{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:center}.c8{padding-top:0pt;padding-bottom:0pt;line-height:1.1500000000000001;orphans:2;widows:2;text-align:left}.c13{color:#000000;text-decoration:none;vertical-align:baseline;font-size:11pt;font-style:italic}.c1{color:#000000;text-decoration:none;vertical-align:baseline;font-size:11pt;font-style:normal}.c22{background-color:#ffffff;max-width:451.4pt;padding:72pt 72pt 72pt 72pt}.c20{margin-left:63pt;margin-right:91.5pt}.c6{color:inherit;text-decoration:inherit}.c18{font-weight:400;font-family:"Arial"}.c19{color:#1155cc;text-decoration:underline}.c0{font-weight:400;font-family:"Comic Sans MS"}.c5{padding:0;margin:0}.c9{width:33%;height:1px}.c21{vertical-align:super}.c16{font-size:10pt}.c11{color:#ff0000}.c17{height:11pt}.c15{font-style:italic}.title{padding-top:0pt;color:#000000;font-size:26pt;padding-bottom:3pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:0pt;color:#666666;font-size:15pt;padding-bottom:16pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:"Arial"}p{margin:0;color:#000000;font-size:11pt;font-family:"Arial"}h1{padding-top:20pt;color:#000000;font-size:20pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:18pt;color:#000000;font-size:16pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:16pt;color:#434343;font-size:14pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:14pt;color:#666666;font-size:12pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}</style></head><body class="c22"><p class="c7"><span class="c1 c18">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span></p><p class="c10"><span class="c13 c0">Algoritmo del Clima</span></p><p class="c4"><span class="c1 c18"></span></p><p class="c10"><span class="c13 c0">Breve riflessione sulla pre-vedibilit&agrave;/dicibilit&agrave; in ambito meteo climatico.</span></p><p class="c4"><span class="c0 c13"></span></p><p class="c10"><span class="c1 c0">La disponibilit&agrave; di informazioni sia meteo che climatica per un luogo fisico o per un&#39;area &egrave; sicuramente diventato uno degli &ldquo;assets&rdquo; di conoscenza strategica, valida e forse utile, per numerosi e svariati campi di attivit&agrave; umane. Mobilit&agrave;, turismo, agricoltura, sicurezza sono ad esempio i settori che guidano oggi la richiesta di informazione meteo-climatica sia del presente che passata ma soprattutto quella futura pur con orizzonti temporali diversificati in funzione dell&#39;impiego di questa informazioni. Non solo, la veicolazione di queste che oggi acquistano status di prodotto, e quindi di bene economico (&ldquo; le previsioni meteo&rdquo;), &egrave; uno degli elementi portanti del traffico web e i siti/portali meteo sono grandissimi catalizzatori di attenzione pubblica su internet e sui canali associati.</span></p><p class="c10"><span class="c1 c0">Le affermazioni sul meteo, futuro, sono ormai qualcosa che si &ldquo;attende&rdquo; con un intervallo temporale sempre pi&ugrave; corto in termini di aggiornamento ( &ldquo;accelerazione di notifica&rdquo;) da cui ci si aspetta una descrizione geo-localizzata su orizzonti sempre pi&ugrave; lunghi e dettagliato. Lo sviluppo della tecnologia di calcolo e gli algoritmi sottostante rendono questo &ldquo;fiume-in-piena&rdquo; reale e possibile e spesso questo diventa elemento monopolizzante la cronaca quotidiana. Diventa &nbsp;In questo contesto de facto cos&igrave; liquido per quanto riguarda l&rsquo;autorevolezza delle informazioni meteorologiche che climatiche c&rsquo;&egrave; un rischio di fragilit&agrave; per la medesima dovuto sia all&#39;eccesso di offerta comunicativa sia all&rsquo;attuale grande possibilit&agrave; di scelta dei canali di accesso (rete, mass media, applicazioni mobile, canali social media/messaggistica) a questo informazione che spesso genera un disorientamento nel generico fruitore .</span></p><p class="c10"><span class="c1 c0">Non &egrave; assolutamente peregrina l&rsquo;idea di tornare a porsi domande forti su cosa sia e cosa significa la propriet&agrave; forse pi&ugrave; identitaria dell&rsquo;argomento meteo/clima: la predicibilit&agrave; cio&egrave; la possibilit&agrave; di fare affermazioni ( dicibilit&agrave;) , anche probabilistiche, o di avere un quadro (vedi-bilit&agrave;) sullo stato del tempo atmosferico prossimo o del regime climatico medio che ci attende rispettivamente nelle successive ore o nella/e prossima /e settimana/e [1].</span></p><p class="c10"><span class="c1 c0">Parlare del futuro non &egrave; scontato e prevedere ha sempre avuto un fascino che sconfina nell&rsquo;esoterico. Le scienze dell&rsquo;atmosfera sono anche questo e oggi sono sul palcoscenico e il dibattito o l&rsquo;argomento cambiamenti climatici altro non fa che magnificare questo vero e proprio &ldquo;charme/carisma&rdquo; scientifico.</span></p><p class="c10"><span class="c1 c0">Prevedere il comportamento dell&rsquo;atmosfera nel tempo, dal punto di vista fisico elementare, &egrave; sempre una questione pertinente alla fluidodinamica, cio&egrave; a quella disciplina che si occupa specificamente della dinamica dei fluidi, cio&egrave; di materiali a deformazione illimitata. </span></p><p class="c10"><span class="c0">Images sources :</span><span class="c19 c0"><a class="c6" href="https://www.google.com/url?q=https://www.ocean.washington.edu/research/gfd&amp;sa=D&amp;ust=1509186242561000&amp;usg=AFQjCNGNUVXiWrG5sNtazpFcXdZ57r2MJA">https://www.ocean.washington.edu/research/gfd</a></span><span class="c1 c0">&nbsp;</span><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 446.60px; height: 197.50px;"><img alt="IMG_5540-betaplane-gyre-sm.jpg" src="images/image4.jpg" style="width: 446.60px; height: 197.50px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c10"><span class="c1 c0">L&rsquo;atmosfera pu&ograve; essere assimilata/modellizzata ad un fluido e dal punto di vista matematico la descrizione della sua fenomenologia nel tempo ha una sua teoria propria che propone delle sue equazioni: le ben note Navier Stokes. Queste sono equazioni famose e la loro soluzione non approssimata &egrave; uno dei 7 problemi del millennio. Sono la base degli algoritmi dinamici del clima e del meteo che trovano applicazione nei cosiddetti modelli meteo-climatici numerici. Questi lavorano su partizionamenti regolari di aree reali geografiche: le cosiddette griglie di &nbsp;calcolo. Queste sono strumenti assimilabili a pile di &nbsp;mosaicature dove in ciascuna piastrella sono descritte numericamente le propriet&agrave; dell&rsquo;atmosfera o delle superfici relativi &nbsp;( quote, superfici, stato generale e propriet&agrave; fisiche). La griglia di calcolo opera su scala globale ( modelli globali) o su scala limitata ( modelli regionali/locali). Descrivere il comportamento dell&rsquo;atmosfera ( fluido) e delle sue propriet&agrave; fondamentali ( velocit&agrave; e temperatura) nel tempo vuol dire risolvere simultaneamente per ciascuna piastrella della griglia di calcolo , da terra fino in quota, tutte le equazioni Navier Stokes accoppiate e inizializzate con dati reali misurati dal sistema osservativo terrestre. </span></p><p class="c4"><span class="c1 c0"></span></p><p class="c10"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 610.50px; height: 332.00px;"><img alt="Sphere-grid-slider-v2.png" src="images/image2.png" style="width: 610.50px; height: 332.00px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c10"><span class="c0">Fonte immagine: </span><span class="c19 c0"><a class="c6" href="https://www.google.com/url?q=http://www.ecmwf.int/&amp;sa=D&amp;ust=1509186242562000&amp;usg=AFQjCNHZmPu1bGCKEVPS0MUud_1cbKzuug">http://www.ecmwf.int/</a></span></p><p class="c4"><span class="c1 c0"></span></p><p class="c7"><span class="c1 c0">Lo sforzo del calcolo &egrave; notevole perch&eacute; il numero delle piastrelle, contando anche quelle lungo la quota,sfiora il miliardo. Questo &egrave; il compito dei grossi centri di calcolo del meteo, come quello europeo ECMWF, che letteralmente fanno le previsioni numeriche per tutto il globo. Gli algoritmi del meteo-clima quindi sono inquadrati e gestiti da sforzi sovranazionali e richiedono investimenti e impegni notevoli. E&rsquo; inevitabile spendere qualche parola in pi&ugrave; sulle equazioni che sono alla base di questo impianto di produzione di &ldquo;previsioni meteorologiche&rdquo;</span></p><p class="c7"><span class="c0">Queste si risolvono come nel caso del nostro &ldquo;sistemone&rdquo; conoscendo le condizioni iniziali del sistema climatico e con algoritmi che danno sempre una soluzione </span><span class="c0 c15">approssimata</span><span class="c1 c0">, mai di tipo esatta. Quindi mappiamo alcune affermazioni come fossero le dita d&#39;una mano e allo stesso tempo un segno per comunicare &ldquo;fermi un attimo&rdquo;:</span></p><p class="c3"><span class="c1 c0"></span></p><ul class="c5 lst-kix_22iaaw6gusfk-0 start"><li class="c2"><span class="c0">Utilizzando sempre dati riferiti ad uno stato iniziale definiti come </span><span class="c0 c15">&ldquo;</span><span class="c0 c11 c15">condizioni iniziali</span><span class="c1 c0">&rdquo;</span></li><li class="c2"><span class="c0">Strutturalmente , per la natura del fluido considerato ( atmosfera&rdquo;), stabiliscono relazioni fra i parametri di tipo &ldquo;</span><span class="c0 c11 c15">non lineare</span><span class="c1 c0">&rdquo; quindi mai proporzionale. </span></li><li class="c2"><span class="c0">Il cammino e i valori assunti dai parametri atmosferici tra un ipotetico </span><span class="c0 c11">&ldquo;</span><span class="c0 c11 c15">stato iniziale</span><span class="c0">&rdquo; riferito ad un tempo T(0) e uno &nbsp;</span><span class="c0 c11">&ldquo;</span><span class="c0 c11 c15">stato finale</span><span class="c0">&rdquo; riferito ad &nbsp;un tempo T(t) generico dipende dal valore delle variabili assunto come condizioni iniziali ( &ldquo;</span><span class="c0 c11 c15">sensibilit&agrave; alle condizioni iniziali</span><span class="c1 c0">&rdquo;). Questo fenomeno &egrave; noto in ambito di divulgazione scientifico come &ldquo;effetto farfalla&rdquo; [2] che prende nome dalla forma &nbsp;defamoso grafico dell&rsquo;attrattore di Lorenz, eminente meteorologo.</span></li><li class="c2"><span class="c1 c0">La non linearit&agrave;, fonte del fenomeno precedente citato, non &egrave; intesa solo interna alla singola equazione ma anche nelle relazioni che vi sono quando pi&ugrave; equazioni devono accoppiate come nel caso della griglia di calcolo. Pi&ugrave; il sistema preso in considerazione &egrave; complesso ( dettaglio spaziale maggiore) il sistema si dice che ha0 un maggior numero di &ldquo;gradi di libert&agrave;&rdquo; . </span></li><li class="c2"><span class="c1 c0">Pi&ugrave; il sistema &egrave; complesso,pi&ugrave; difficile sar&agrave; la stima delle condizioni iniziali, i &nbsp;fenomeni di non linearit&agrave; pi&ugrave; pesanti e cresce a dismisura la sensibilit&agrave; iniziali e quindi anche una ridottissima differenza &nbsp;della valutazione dello stato iniziale porta a valutazioni finali diverse.</span></li></ul><p class="c14"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 244.50px; height: 287.47px;"><img alt="330px-Raczka4.jpg" src="images/image6.jpg" style="width: 244.50px; height: 287.47px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c14"><span class="c1 c0">Fonte immagine : Wikipedia - &nbsp;https://it.wikipedia.org/wiki/Mano</span></p><p class="c7"><span class="c1 c0">&nbsp; &nbsp; &nbsp; </span></p><p class="c3"><span class="c1 c0"></span></p><p class="c7"><span class="c0">Queste 5 affermazioni fanno si che anche infinitesime variazioni o semplicemente la quota di errore nello stato iniziale produce applicando le nostre equazioni del meteo/clima, valutazioni finali anche molto diverse in ragione delle relazioni di non linearit&agrave;. Il linguaggio dei meteorologi fisici parl&agrave; di &ldquo;</span><span class="c0 c11 c15">propagazione dell&rsquo;errore</span><span class="c1 c0">&rdquo; che inevitabilmente cresce nel tempo e nello spazio, proprio in virt&ugrave; della non linearit&agrave; intrinseca degli oggetti matematici usati. Se pensiamo che le previsioni meteorologiche ogni 6 ore fanno lavorare 1 miliardo ( 10E+9) di equazioni per un intervallo di tempo di 3 giorni come minimo, ci rendiamo conto che &ldquo;prevedere&rdquo; non &egrave; altro che dominare il &ldquo;golem&rdquo; dell&rsquo; errore che nasce proprio connaturato all&rsquo;uso stesso delle equazioni di previsioni e dall&rsquo;errore nella misura delle condizioni iniziali, che dovrebbero spiegare il comportamento di ogni singolo pezzo di atmosfera.</span></p><p class="c14"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 268.50px; height: 295.71px;"><img alt="1200px-Prague-golem-reproduction.jpg" src="images/image3.jpg" style="width: 268.50px; height: 295.71px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c14"><span class="c1 c0">Golem di praga. Fonte Wikipedia - https://it.wikipedia.org/wiki/Golem</span></p><p class="c3"><span class="c1 c0"></span></p><p class="c7"><span class="c0">Il limite di predicibilit&agrave; delle previsioni meteo-climatiche &egrave; fissato infatti con la grandezza tempo ed &egrave; detto proprio </span><span class="c0 c11">&ldquo;tempo di predicibilit&agrave;</span><span class="c1 c0">&rdquo;, come fossimo davanti ad un prodotto alimentare per cui viene fissato un limite massimo di commestibilit&agrave;. Questo &egrave; obbligatorio porlo in etichetta se l&rsquo;alimento deperibile. Le previsioni meteo sono prodotti deperibili? Si ed per questo che vanno rigenerate di frequente in modo da aggiornare le &ldquo;condizioni iniziali&rdquo; .</span></p><p class="c7"><span class="c1 c0">Non solo capiamo anche il perch&egrave; del mantra di ogni richiesta dei centri di meteorologia ufficiali : &ldquo;pi&ugrave; osservazioni ...pi&ugrave; calcolo &hellip;.( pi&ugrave; meteorologi) &hellip;.migliori previsioni&rdquo;.</span></p><p class="c7"><span class="c1 c0">Sul tempo di predicibilit&agrave; e complessit&agrave;, leggi dettaglio spaziale e temporale delle previsioni , sono in conflitto paradossalmente proprio grazie agli algoritmi usati.</span></p><p class="c7"><span class="c0">La sensibilit&agrave; &nbsp;alle condizioni iniziali &egrave; indubbiamente un limite ma &egrave; anche un fenomeno che pu&ograve; sfruttato per fare previsioni pi&ugrave; affidabili ( o meglio dove pu&ograve; essere valutata l&rsquo;accuratezza cio&egrave; quando una singola/serie previsione/i potr&agrave;/anno avvicinarsi allo stato atteso ad un determinato tempo futuro). Modificando, o </span><span class="c0 c11 c15">&ldquo;perturbando</span><span class="c0">&rdquo; come si dice, in maniera adatta possiamo avere il profilo di diverse previsioni ( una per ogni condizioni iniziale) e quindi prendendo il risultato di tutte le previsioni ( detti anche &ldquo;</span><span class="c0 c11">membri</span><span class="c0">&rdquo; che assieme &nbsp;formano il cosiddetto </span><span class="c0 c11">&ldquo;ensemble</span><span class="c0">&rdquo;) &egrave; possibile visualizzare la rosa delle evoluzioni di un parametro con un grafico detto spaghetti-plot, nel quale &egrave; facile individuare il tempo di predicibilit&agrave;, cio&egrave; quel dato momento in cui la divergenza fra le varie simulazioni &nbsp;per un/i parametro/i diventa grande. Se rimangono dentro il tempo di predicibilit&agrave; queste non sono &nbsp;altro che le &ldquo;</span><span class="c0 c11">previsioni probabilistiche</span><span class="c1 c0">&rdquo;, cio&egrave; con tante previsioni &egrave; possibile esprimere per un evento o per una soglia di parametro un probabilit&agrave; di accadimento o di superamento/attraversamento.Una probabilit&agrave; ovvero una valutazione su uno stato atteso. Dato un tempo di riferimento iniziale e uno futuro uno spaghetti-plot [5] pu&ograve; essere visualizzato nel tempo o anche come impronta nello spazio e quindi di per s&egrave; mappabile. </span></p><p class="c7"><span class="c1 c0">Un esempio ci viene fornito dalla previsione probabilistica delle precipitazioni che hanno portato all&rsquo;alluvione in toscana e in veneto nel novembre del 1966 effettuata dal Dott. Valerio Capecchi del Consorzio LaMMA da cui riportiamo la figura successiva. In questa vengono rappresentati a sinistra della figura gli N linee di sconfinamento ( una per membro) di un determinato livello di pressione ( 500hpa ) come spaghetti-plot e a destra la probabilit&agrave; (ottenuta dall&rsquo;intero insieme della pioggia prevista - ensemble - dei membri) di superare la soglia dei 50 mm di pioggia. </span></p><p class="c3"><span class="c1 c0"></span></p><p class="c7"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 602.00px; height: 446.67px;"><img alt="val.jpg" src="images/image5.jpg" style="width: 602.00px; height: 446.67px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c3"><span class="c1 c0"></span></p><p class="c3"><span class="c1 c0"></span></p><p class="c7"><span class="c0">Poich&eacute; l&rsquo;algoritmo del clima/meteo, o meglio gli schemi di previsione della meteorologia e della climatologia</span><sup class="c0"><a href="#ftnt1" id="ftnt_ref1">[1]</a></sup><span class="c0">&nbsp;sono sempre quelli &egrave; possibile, ipotizzando delle successioni continua di condizioni iniziali </span><sup class="c0"><a href="#ftnt2" id="ftnt_ref2">[2]</a></sup><span class="c0">estesa nello spazio o nel tempo, fare della meteorologia virtuale come se fosse reale. E&rsquo; possibile fare quindi esperimenti fisico-numerici</span><sup class="c0"><a href="#ftnt3" id="ftnt_ref3">[3]</a></sup><span class="c1 c0">&nbsp;giocando sulle &ldquo;piastrelle&rdquo; delle griglie di calcolo, &nbsp;mettendo/togliendo rilievi, modificando temperature e stato del mare o ipotizzando crescite pi&ugrave; o meno veloce dei gas-serra e tutto quello che &egrave; possibile immaginare, e vedere su simulazioni temporalmente sufficientemente lunghe ( e libere dalla costrizione di dover dare le informazioni per un luogo o per un punto a terzi) cosa succede in media nel tempo ai parametri pi&ugrave; importanti. </span></p><p class="c7"><span class="c0">Qui stiamo parlando di esperimenti/scenari climatici e di &ldquo;</span><span class="c0 c11">previsioni climatiche</span><span class="c0">&rdquo;,nelle quali vengono sostanzialmente applicati poi modelli gi&agrave; usati per fare le previsioni meteorologiche ma con un quadro di complessit&agrave; spaziale e temporale molto ma molto minore in modo da permettere una certa ripetibilit&agrave; della simulazione stessa. Le uscite di queste simulazioni possono avere un valore predittivo e su orizzonti futuri lunghi. Sono quelli che i grandi enti internazionali di studio sui cambiamenti climatici come IPCC [6] usano nella loro comunicazione sul clima atteso futuro. La loro affidabilit&agrave; risiede nella capacit&agrave; dei ricercatori &nbsp;di fare ipotesi fisicamente sensate e coerenti e di usare dei dati considerati validi. Sono modelli necessariamente meno complessi appunto di quelli meteo, perch&eacute; come abbiamo detto complessit&agrave; e errore sono stretti parenti in qualsiasi algoritmo climatico. Una particolare classe di simulazioni che si pongono come un via di mezzo fra le previsioni climatiche e quelle meteorologiche, sono le &ldquo;</span><span class="c0 c11">previsioni stagionali</span><span class="c1 c0">&rdquo;, e sono orientate a prevedere il regime medio termico o pluviometrico, e le sue deviazioni rispetto ad una climatologia di riferimento (attualmente &egrave; quella relativa al periodo 1981-2010), con un orizzonte temporale che va dai 21 giorni ai 9 mesi di tempo. Sono un prodotto particolarmente ambito ma che alle nostre latitudini boreali medie ( 35-70 &deg; Lat) presenta problemi legati al mescolamento rapido e alla complessit&agrave; della circolazione atmosferica. </span></p><p class="c7"><span class="c0">Si perch&egrave; in generale &egrave; possibile fare un&rsquo;altra affermazione sulla predicibilit&agrave;. Esistono climi dove la predicibilit&agrave; </span><sup class="c0"><a href="#ftnt4" id="ftnt_ref4">[4]</a></sup><span class="c0 c1">&nbsp;&egrave; pi&ugrave; agevole. Per le zone polari e le zone tropicali/equatoriali le previsioni stagionali ad esempio possono essere fatte utilizzando modelli che usano configurazioni basate su parametri a forte memoria (come la temperatura del mare o l&rsquo;estensione dei ghiacci).</span></p><p class="c8"><span class="c0">Infine andando oltre l&rsquo;impostazione fisica del problema delle previsioni meteo-climatiche, anche grazie all&rsquo;applicazione di algoritmi provenienti dalla scienza statistica &egrave; possibile fare previsioni numeriche</span><span class="c0 c21">2</span><span class="c0">. L&rsquo;applicazione degli algoritmi statistici pu&ograve; avvenire sia su dati di natura osservativa sia su dati provenienti da modellistica dinamica. La statistica &egrave; gia parte integrante e corrente delle analisi delle previsioni meteorologiche e climatiche specialmente in termini di valutazione dell&rsquo;errore o meglio dell&rsquo;incertezza di un monitoraggio o direttamente di una previsione come quella fase successiva di validazione e verifica della previsione o si un set di previsioni. Model Output Statistics (MOS) &egrave; uno degli acronimi anglofoni correnti quando si parla di modellistica previsionale. Uno dei metodi statistici pi&ugrave; conosciuti &egrave; il &ldquo;</span><span class="c0 c11">metodo degli analoghi</span><span class="c1 c0">&rdquo;: cio&egrave; avendo davanti una situazione meteorologica/climatica per un&rsquo;area si cerca di &ldquo;riconoscere&rdquo; in un database di archivi o di osservazioni quale sia la/e pi&ugrave; simile/i ( e questa valutazione viene fatta in termini di distanza statistica) e quindi viene presa come come previsione valida le situazioni o gli eventi successivi associati o un loro derivato statistico se si vuole .</span></p><p class="c8"><span class="c1 c0">L&rsquo;applicazione e la validit&agrave; dei metodi statistici nel campo della previsione dipende da diversi fattori: sicuramente dali parametro che si cerca di prevedere e dalla disponibilit&agrave; di un archivio storico che abbia una copertura completa della casististica a livello stagionale.</span></p><p class="c8"><span class="c0">Altri algoritmi utilizzati in meteorologia sono molto simili a quelli utilizzati in ambito finanziario ( modelli ARIMA o autoregressivi) e servono per prodotti locali di dettaglio di parametri specifici come ad esempio la previsione degli estremi termici in alcuni singoli luoghi. Gli algoritmi statistici sono &ldquo;data-driven&rdquo; cio&egrave; vengono guidati direttamente dalle informazioni contenute nelle serie di dati osservativi, che possono provenire generalmente da sensoristica ambientale orientata a parametri di interesse meteo. La qualit&agrave; e la processabilit&agrave; dei dati come la loro affidabilit&agrave; nel tempo sono i requisiti di base per poi avere delle previsioni di qualit&agrave;. Gli algoritmi statistici non come quelli dinamici precedentemente descritti non si limitano al mero dato di previsione, ma sono soliti fornire delle grandezze che descrivono esplicitamente l&rsquo;incertezza della previsione stessa. Sono strumenti quali l&rsquo;intervallo di confidenza del dato medio, l&rsquo;Akaike Information Criterion (AIC)</span><sup class="c0"><a href="#ftnt5" id="ftnt_ref5">[5]</a></sup><span class="c0">&nbsp;e altri ancora in funzione del tipo di metodo o algoritmo adottato. Incertezza diventa, con l&rsquo;ingresso della statistica e il trattamento esplicito della probabilit&agrave; associata ad un dato di previsione una parola importante. Le previsioni serie nel campo fisico-statistico sempre devono dichiarare la loro incertezza che dovrebbe crescere nel tempo fino ad inquadrare anche qui un &ldquo;</span><span class="c0 c11">tempo di predicibilit&agrave;</span><span class="c0">&rdquo;; un confine dopo il quale la validit&agrave; della previsione pu&ograve; essere il valore alimentare di un pesce lasciato una settimana sull&rsquo;Aurelia a Livorno cio&egrave; in qualche modo la sua &ldquo;scadenza&rdquo;.&ldquo;Con questa iperbole introduco gli ultimi scorci di riflessione sulla pre-dicibilit&agrave;/vedibilit&agrave; nel clima, che come abbiamo visto necessitano di plurale quando si parla di &ldquo;algoritmo del clima&rdquo; vista la loro diversa tipologia. Questa &ldquo;diversit&agrave;&rdquo; permette in questo campo lo sviluppo di &ldquo;strategie di previsioni&rdquo; con un possibile sapiente impiego di un mix metodologico, che il meteorologo o il climatologo possono utilizzare quando hanno definito il loro obiettivo. Fare previsioni vuol dire dichiarare esplicitamente o implicitamente una scala temporale e una spaziale a priori per aver chiaro cos&igrave; I limiti di prevedibilit&agrave;, che ogni giorno possono essere diversi nel campo e nello spazio. Un altro concetto, sempre legato alla dimensione temporale, pu&ograve; essere fornito dalle scienze statistiche in funzione della probabilit&agrave; di accadimento di un evento o di uno stato futuro: il </span><span class="c0 c11">&ldquo;tempo di ritorno</span><span class="c1 c0">&rdquo;.</span></p><p class="c8"><span class="c1 c0">E&rsquo; l&rsquo;inverso di una probabilit&agrave; di accadimento ed &egrave; misurato di solito in anni. Serve a classificare la natura estremale di un evento. Non &egrave; usato per fare previsioni ma &egrave; un elemento importante che spesso viene preso in considerazione in fase di analisi prima delle previsioni e nasce dall&rsquo;analisi dei dati osservati. Un dato evento e di un data magnitudo si dice che ha un tempo di ritorno di N anni, quando &egrave; probabile al 95% che possa accadere in un lasso di tempo. </span></p><p class="c8"><span class="c0">In meteorologia l&rsquo;eccesso di dettaglio &egrave; sempre sintomo sospetto di &ldquo;abuso di algoritmo&rdquo;. Quest termine lo prendo in prestito dal linguaggio dello sport del tennis (abuso di racchetta &ndash; racket abuse</span><sup class="c0"><a href="#ftnt6" id="ftnt_ref6">[6]</a></sup><span class="c1 c0">) dove viene penalizzato l&rsquo;uso improprio dello strumento racchetta. Si abusa degli algoritmi quando si comunicano previsioni con precisioni che non sono quelle del algoritmo di previsione nativo, ma sono ottenute con altri algoritmi matematici di natura interpolatoria, che trattano I dati in fase di comunicazione grafica o numerica come fossero in un campo dotato di continuit&agrave; dimenticandosi la natura &ldquo;discreta&rdquo; delle griglie di calcolo e della loro scala spaziale e temporale, rispettivamente &nbsp;25 km e 3 ore circa. L&rsquo;abuso di algoritmo &egrave; comune nel mercato del meteo e spesso risponde a logiche di comunicazione effettiva, la quale deve presentare anche un estetica di rappresentazione della previsione adatta appunto per I vari canali mediatici o di servizio istituzionale.</span></p><p class="c8"><span class="c1 c0">Quest&rsquo;ultimo &egrave; un punto decisivo perch&eacute; una cultura del limite scientifico e dell&rsquo;incertezza &egrave; uno dei gap culturali percepibili in questo campo, che chiama gli operatori della comunicazione a questa missione di &ldquo;educazione narrativa&rdquo; capace di non fondere necessariamente funzione e tecnologia. Il senso di onnipotenza tecnologico basato su una specie di obesit&agrave; informativa degli utenti che &egrave; una delle conseguenze &nbsp;date dall&rsquo;abuso di algoritmo. </span></p><p class="c8 c17"><span class="c1 c0"></span></p><p class="c8"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 602.00px; height: 452.00px;"><img alt="incertezza-e-rischio.jpg" src="images/image1.jpg" style="width: 602.00px; height: 452.00px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c8 c17"><span class="c1 c0"></span></p><p class="c8"><span class="c1 c0">Per finire poi lascio intatto la presentazione del libro del pi&ugrave; grande statistico italiano Bruno De Finetti a riguardo di chi vuol giudicare chi opera in base alle previsioni</span></p><p class="c8 c17"><span class="c1 c0"></span></p><p class="c8 c20"><span class="c13 c0">&ldquo;Le previsioni non sono predizioni, e quindi non ha senso confrontare le previsioni coi risultati per discutere se questi le hanno confermate o smentite, come se di quelle avesse senso chiedersi, col senno del poi, se fossero state esatte o sbagliate. Spesso sembra quasi sentir gabellare come realismo il giudicare secondo i risultati, considerare che la misura dei meriti &egrave; data dal successo, trascurando come insignificante il soffermarsi sui se e sui ma. Certo ci&ograve; &egrave; insignificante rispetto ai fatti, che indubbiamente nessun se e nessun ma pu&ograve; cancellare n&eacute; modificare n&eacute; ritoccare. I fatti non ammettono appello. Ma un&#39;altra cosa &egrave; il giudizio sui fatti, la valutazione delle responsabilit&agrave;, l&#39;apprezzamento o la critica all&#39;operato di ciascuno. A questi effetti, no, il verdetto sui fatti non &egrave; inappellabile, anzi, non ha valore alcuno. O ne ha soltanto se aiuta a vedere meglio l&#39;insieme dei se e dei ma che soli permettono di giudicare l&#39;operato nell&#39;unico senso in cui ha senso, cio&egrave; nell&#39;atto e nella situazione e nello stato di informazione in cui l&#39;operare si svolgeva, momento per momento.&rdquo; </span></p><p class="c8 c20"><span class="c13 c0">B. de Finetti, Teoria delle probabilit&agrave;, Torino, Einaudi, 1970 (Milano, Giuffr&egrave;, 2005), pp. 244-246. &nbsp; </span></p><p class="c7"><span class="c1 c0">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span></p><p class="c10"><span class="c1 c0">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span></p><p class="c3"><span class="c1 c0"></span></p><p class="c3"><span class="c1 c0"></span></p><p class="c3"><span class="c1 c0"></span></p><p class="c3"><span class="c1 c0"></span></p><p class="c3"><span class="c1 c0"></span></p><p class="c3"><span class="c1 c0"></span></p><p class="c3"><span class="c1 c0"></span></p><p class="c3"><span class="c1 c0"></span></p><p class="c3"><span class="c1 c0"></span></p><p class="c7"><span class="c1 c0">Risorse CNR</span></p><p class="c3"><span class="c1 c0"></span></p><p class="c7"><span class="c1 c0">[A] &quot;Previsioni, incertezza, modelli meteo&quot;,Valentina Grasso e Federica Zabini,CNR Ibimet Consorzio LaMMA website https://alfcrisci.github.io/algoritmo_del_clima/previsioni_incertezza_grasso_zabini.pdf</span></p><p class="c7"><span class="c1 c0">[A] Tiziana Pccagnella e Stefano Tibaldi et al, ARPAL&rsquo;incertezza nella previsione meteorologica</span></p><p class="c7"><span class="c1 c0">https://www.arpae.it/SMR/archivio/downloads/centro_funzionale/Paccagnella-Tibaldi.ppt</span></p><p class="c7"><span class="c1 c0">[B] http://www.formascienza.org/caffe4.asp</span></p><p class="c3"><span class="c1 c0"></span></p><p class="c3"><span class="c1 c0"></span></p><p class="c7"><span class="c1 c0">Riferimenti</span></p><p class="c7"><span class="c1 c0">[1] http://www.ilsecoloxix.it/p/genova/2014/11/22/ARg6qBeC-meteorologia_prevedere_consapevolezza.shtml</span></p><p class="c7"><span class="c1 c0">[2] Modello Globale Europeo di previsione</span></p><p class="c7"><span class="c19 c0"><a class="c6" href="https://www.google.com/url?q=https://www.ecmwf.int/sites/default/files/ECMWF_grid_infographic.pdf&amp;sa=D&amp;ust=1509186242597000&amp;usg=AFQjCNGyCUQ4v08LkiB3y38c4D8u4EbKzw">https://www.ecmwf.int/sites/default/files/ECMWF_grid_infographic.pdf</a></span></p><p class="c7"><span class="c1 c0">[3] https://it.wikipedia.org/wiki/Effetto_farfalla</span></p><p class="c7"><span class="c0">[4] </span><span class="c0 c19"><a class="c6" href="https://www.google.com/url?q=https://it.wikipedia.org/wiki/Edward_Norton_Lorenz&amp;sa=D&amp;ust=1509186242598000&amp;usg=AFQjCNGZkfROUo4mNHpr2hRvrcmaPRnpUw">https://it.wikipedia.org/wiki/Edward_Norton_Lorenz</a></span></p><p class="c7"><span class="c1 c0">[5] https://en.wikipedia.org/wiki/Spaghetti_plot</span></p><p class="c7"><span class="c0">[6] https://en.wikipedia.org/wiki/Intergovernmental_Panel_on_Climate_Change</span></p><p class="c3"><span class="c1 c0"></span></p><hr class="c9"><div><p class="c10"><a href="#ftnt_ref1" id="ftnt1">[1]</a><span class="c16">&nbsp;</span><span>&nbsp;Bisogna stare attenti a usare la parola schema con i meteorologi perch&egrave; spesso questo significa &ldquo;sotto-modello&rdquo;. Ad esempio l&rsquo;affermazione un modello meteorologico ha uno schema radiativo X vuol dire che un modello -quello delle griglie per intendersi- ha un sotto modello che simula solo della radiazione solare</span></p></div><div><p class="c10"><a href="#ftnt_ref2" id="ftnt2">[2]</a><span class="c16">&nbsp;</span><span>Prendono nome di &nbsp;condizioni &ldquo;</span><span class="c11">al contorno</span><span>&rdquo; se la griglia di calcolo non &egrave; globale. </span></p></div><div><p class="c10"><a href="#ftnt_ref3" id="ftnt3">[3]</a><span class="c16">&nbsp;</span><span>Possiamo fare &ldquo;simulazioni&rdquo; perch&egrave; va detto che le previsioni meteorologiche numeriche pur rimanendo sempre delle simulazioni perdono il loro &ldquo;rango&rdquo; quando non si parla pi&ugrave; del tempo degli umani ma di tempi indicati come grandezza generica.</span></p></div><div><p class="c10"><a href="#ftnt_ref4" id="ftnt4">[4]</a><span class="c12">&nbsp;Ora &egrave; possibile definire predicibilit&agrave; come grandezza in base al suo tempo di predicibilit&agrave;.</span></p></div><div><p class="c10"><a href="#ftnt_ref5" id="ftnt5">[5]</a><span class="c12">&nbsp; Sono parametri di misura della dispersione del dato ( intervallo di confidenza) o della capacit&agrave; di un modello statistico di spiegare in modo parsimonioso un feomeo.Sono misure di validit&agrave;. </span></p></div><div><p class="c10"><a href="#ftnt_ref6" id="ftnt6">[6]</a><span class="c12">&nbsp;Abuso di racchetta https://en.wikipedia.org/wiki/Unsportsmanlike_conduct</span></p></div></body></html>